responseTemplates/srvloans.xml

<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="urn:ucbru:gbo:v3:st" xmlns:ns3="urn:ucbru:gbo:v3" xmlns:ns6="urn:ucbru:gbo:v5:spdep" xmlns:ns20="urn:ucbru:esb:srv:sms" xmlns:ns5="urn:ucbru:gbo:v5:loan" xmlns:ns8="urn:ucbru:gbo:v5:cif" xmlns:ns7="urn:ucbru:gbo:v5" xmlns:ns13="urn:ucbru:gbo:v5:scust" xmlns:ns9="urn:ucbru:gbo:v5:ordst" xmlns:ns12="urn:ucbru:gbo:v5:acc" xmlns:ns11="urn:ucbru:gbo:v5:docst" xmlns:ns10="urn:ucbru:gbo:v5:card" xmlns:ns21="http://mfms.ru/mfmsgate/push/devices" xmlns:ns17="urn:ucbru:gbo:v4" xmlns:ns16="urn:ucbru:gbo:v5:push:devices:request" xmlns:ns15="urn:ucbru:gbo:v5:push:devices:response" xmlns:ns14="urn:ucbru:gbo:v5:sdpmt" xmlns:ns19="urn:imb:gbo:BSCardAuthorization" xmlns:ns18="urn:imb:gbo:BSCardStm">
    <ns2:Header>
        <gbo:UCBRUHeaders xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:ucbru:gbo:v3">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SRVLOAN.CustomerLoansQuery</gbo:Application.Module>
                        <gbo:VersionId>v3</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SRVLOAN.CustomerLoansQuery</gbo:Application.Module>
                        <gbo:VersionId>v3</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </ns2:Header>
    <ns2:Body>
        <ns3:CustomerLoans>
            <ns3:CustomerNo>${receive.id}</ns3:CustomerNo>
            <ns3:Loans>
                <ns3:Loan>
                    <ns3:ContractRef>01977060RURRM10001</ns3:ContractRef>
                    <ns3:ProductCategory>MORTGAGE</ns3:ProductCategory>
                    <ns3:RepayAmount>3122.52</ns3:RepayAmount>
                    <ns3:RepayInterest>725.48</ns3:RepayInterest>
                    <ns3:CCY>RUR</ns3:CCY>
                    <ns3:Principal>75995.99</ns3:Principal>
                    <ns3:NextPaymentDate>2023-07-17</ns3:NextPaymentDate>
                    <ns3:MaturityDate>2025-05-16</ns3:MaturityDate>
                    <ns3:RemainingPayment>82126.6</ns3:RemainingPayment>
                    <ns3:DealDate>2014-10-16</ns3:DealDate>
                    <ns3:UDF>
                        <ns3:Name>AccountNumberCB</ns3:Name>
                        <ns3:Value>45507810350020072602</ns3:Value>
                    </ns3:UDF>
                    <ns3:UDF>
                        <ns3:Name>LoanHolidays</ns3:Name>
                        <ns3:Value>Y</ns3:Value>
                    </ns3:UDF>
                </ns3:Loan>
            </ns3:Loans>
        </ns3:CustomerLoans>
    </ns2:Body>
</ns2:Envelope>